In [19]:
import pandas as pd
pd.set_option('display.max_columns',None)
import sys
sys.path.append("..")
from src import src_eda as src_eda

In [20]:
df_raw=pd.read_csv('../data/data_raw.csv')
df_raw.sample()

,User Id,Group,Visit Date,Conversion,Product Category,Product Id,Product Name,Quantity,Price,Discount,Total Value,Payment Method,Shipping Method,Region,Customer Age,Customer Gender,Device,Session Duration,Coupon Used,Browser,Referral Source
1820,1821,A,30/01/2022,0,ELECTRONICS,P1119,Laptop,0,"915,51","0,11","0,0",NaN,NaN,Central,50.0,F,Desktop,17,NaN,Eddddge,Social

In [21]:
df= df_raw

name changes columns

In [22]:
df.columns= df.columns.str.replace(" " , "_").str.lower()
df.columns

Index(['user_id', 'group', 'visit_date', 'conversion', 'product_category',
       'product_id', 'product_name', 'quantity', 'price', 'discount',
       'total_value', 'payment_method', 'shipping_method', 'region',
       'customer_age', 'customer_gender', 'device', 'session_duration',
       'coupon_used', 'browser', 'referral_source'],
      dtype='object')

visit_date

In [23]:
df['visit_date']=pd.to_datetime(df['visit_date'], format= '%d/%m/%Y')

create conversion str

In [24]:
df['conversion_str']= df['conversion'].apply (lambda x : "yes" if x == 1 else "no")

In [25]:
df.loc[:,['conversion','conversion_str']]

      conversion conversion_str
0              0             no
1              0             no
2              0             no
3              1            yes
4              0             no
...          ...            ...
1995           0             no
1996           0             no
1997           0             no
1998           0             no
1999           0             no

[2000 rows x 2 columns]

change uppercase to lowercase and modify words

In [26]:
df['product_category']= df['product_category'].str.lower()

In [27]:
df['product_category']= df['product_category'].str.replace('fashhion','fashion')

In [28]:
df['product_category'].unique()

array(['books', 'beauty', 'fashion', 'sports', 'toys', 'electronics',
       'home'], dtype=object)

producto_ id

In [29]:
df.sample()

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
1539,1540,B,2022-01-28,0,home,P1382,Chair,0,"412,74","0,09","0,0",NaN,NaN,Central,44.0,F,Mobile,15,NaN,Firefoxxxxxx,Email,no

In [30]:
df['product_id']= df['product_id'].str.replace('P','')

In [31]:
df['product_id']= df['product_id'].astype('int64')

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   int64
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   object
 9   discount          1960 non-null   object
 10  total_value       2000 non-null   object
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
 21  conversion_str    2000 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(5), object(15)
memory usage: 343.9+ KB

producto_name

In [33]:
df['product_name']= df['product_name'].str.replace(' ','_')

In [34]:
def lower(df):
    
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.lower()

In [35]:
lower(df)

In [ ]:
src_eda.lower(df,'product_name')

price

In [37]:
df['price']= df['price'].str.replace(',','.')

In [38]:
def comma (df):
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.replace(',','.')
        try:
            df[col]= df[col]. astype('float64')
        except:
            pass

In [39]:
comma(df)

In [40]:
df.sample(10)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
573,574,b,2022-01-29,0,books,1444,mystery,0,21.61,0.15,0.00,NaN,NaN,central,51.0,f,mobile,21,NaN,chrooome,paid,no
1374,1375,a,2022-03-19,0,beauty,1239,lipstick,0,97.53,0.07,0.00,NaN,NaN,north,20.0,f,tablet,1,NaN,ottttther,organic,no
1729,1730,b,2022-01-22,0,toys,1857,doll,0,NaN,0.15,0.00,NaN,NaN,east,51.0,m,tablet,12,NaN,chrooome,email,no
841,842,b,2022-01-22,1,fashion,1824,jeans,3,61.01,0.02,179.37,paypal,same day,east,42.0,m,desktop,14,yes,eddddge,paid,yes
390,391,b,2022-03-29,0,beauty,1616,mascara,0,98.81,0.22,0.00,NaN,NaN,west,46.0,m,desktop,7,NaN,firefoxxxxxx,email,no
266,267,b,2022-02-08,0,sports,1430,tennis_racket,0,129.38,0.03,0.00,NaN,NaN,south,65.0,f,mobile,23,NaN,ottttther,organic,no
1480,1481,b,2022-02-10,0,beauty,1138,mascara,0,80.85,0.03,0.00,NaN,NaN,south,21.0,f,desktop,14,NaN,eddddge,email,no
269,270,a,2022-03-20,1,toys,1415,puzzle,1,31.74,0.06,29.84,credit card,same day,central,34.0,f,desktop,9,no,safaaaaari,email,yes
306,307,b,2022-02-16,1,books,1145,mystery,4,46.87,0.09,170.61,bank transfer,express,central,46.0,m,mobile,14,no,firefoxxxxxx,paid,yes
1991,1992,a,2022-01-13,0,sports,1591,tennis_racket,0,225.64,0.24,0.00,NaN,NaN,south,27.0,f,mobile,28,NaN,safaaaaari,organic,no

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   int64
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   float64
 9   discount          1960 non-null   float64
 10  total_value       2000 non-null   float64
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
 21  conversion_str    2000 non-null   object
dtypes: datetime64[ns](1), float64(4), int64(5), object(12)
memory usage: 343.9+ KB

In [42]:
def replace_space (df):
    for col in df.select_dtypes(include='O').columns:
        df[col]=df[col].str.replace(' ','_')

In [43]:
replace_space(df)

referral_source

In [44]:
df['browser'].unique()

array(['safaaaaari', 'ottttther', 'firefoxxxxxx', 'eddddge', 'chrooome'],
      dtype=object)

In [45]:
dicc_map={'safaaaaari':'safari',
          'ottttther':'other', 
          'firefoxxxxxx':'firefox', 
          'eddddge':'edge',
          'chrooome':'chrome'}

In [46]:
df['browser']= df['browser'].map(dicc_map)

In [47]:
df['browser'].unique()

array(['safari', 'other', 'firefox', 'edge', 'chrome'], dtype=object)